# FilterStringEndsWith Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringEndsWith Class
Members See Also
---
Tests whether string values from the document end with a certain string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterStringEndsWith : FilterStringRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterStringEndsWith _
	Inherits FilterStringRuleEvaluator
```

Visual C++
---
```text
public ref class FilterStringEndsWith : public FilterStringRuleEvaluator
```

# Remarks
All string comparisons in this class are performed in the case-insensitive manner.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterStringRuleEvaluator Autodesk.Revit.DB..::..FilterStringEndsWith
# See Also
FilterStringEndsWith Members
Autodesk.Revit.DB Namespace